    _________________________________________________________________
    Layer (type)                 Output Shape              Param #   
    =================================================================
    input (InputLayer)           (None, 100)               0         
    _________________________________________________________________
    Dense (Dense)                (None, 20000)             2020000   
    =================================================================
    Total params: 2,020,000
    Trainable params: 2,020,000
    Non-trainable params: 0
    _________________________________________________________________
