    _________________________________________________________________
    Layer (type)                 Output Shape              Param #   
    =================================================================
    encoder_input (InputLayer)   (None, 20000)             0         
    _________________________________________________________________
    noise (GaussianDropout)      (None, 20000)             0         
    _________________________________________________________________
    Dense (Dense)                (None, 100)               2000000   
    =================================================================
    Total params: 2,000,000
    Trainable params: 2,000,000
    Non-trainable params: 0
    _________________________________________________________________
