    __________________________________________________________________________________________________
    Layer (type)                    Output Shape         Param #     Connected to                     
    ==================================================================================================
    anchor_input (InputLayer)       (None, 20000)        0                                            
    __________________________________________________________________________________________________
    positive_input (InputLayer)     (None, 20000)        0                                            
    __________________________________________________________________________________________________
    negative_input (InputLayer)     (None, 20000)        0                                            
    __________________________________________________________________________________________________
    encoder (Model)                 (None, 100)          2000000     anchor_input[0][0]               
                                                                     positive_input[0][0]             
                                                                     negative_input[0][0]             
    __________________________________________________________________________________________________
    decoder (Model)                 (None, 20000)        2020000     encoder[1][0]                    
                                                                     encoder[2][0]                    
                                                                     encoder[3][0]                    
    __________________________________________________________________________________________________
    anchor (Lambda)                 (None, 20000)        0           decoder[1][0]                    
    __________________________________________________________________________________________________
    positive (Lambda)               (None, 20000)        0           decoder[2][0]                    
    __________________________________________________________________________________________________
    negative (Lambda)               (None, 20000)        0           decoder[3][0]                    
    __________________________________________________________________________________________________
    triplet (Model)                 (None, 1)            0           encoder[1][0]                    
                                                                     encoder[2][0]                    
                                                                     encoder[3][0]                    
    ==================================================================================================
    Total params: 4,020,000
    Trainable params: 4,020,000
    Non-trainable params: 0
    __________________________________________________________________________________________________
